'''
Задание 1.

Спросить у пользователя число n.
Напечатать числа от 1 до n. Через пробел.
'''
number = int(input('Enter a number: '))
count = 1
while count <= number:
    print(count)
    count += 1
   
